src/main/resources/customer.xml

<?xml version="1.0" encoding="utf-8"?>

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <SaveJson xmlns="http://frontstep.com/IDOWebService">
            <strSessionToken>
                b/XdI6IQzCviZOGJ0E+002DoKUFOPmVDkwpQDbQjm3w/qkdxDUzmqvSYEZDCmJGWpA23OTlhFpxRHFz3WOsvay8V58XdIp/UIsr5TpCdMwtW3QXF2ahwQYp2O6GzKlJcVckOUV/SBOSUYIUJFO6UvAmjgtjbeXpOTaM049ML+ZZRNPS4/Y8d1V2kJDwVSJXsqpsMkwewSjCp4lx+t74VOp9Gga7eggqP3mp2un11ccnmFvsQrEAY8pA5iphQJhnMOSjLgPttlzKaoB1CFvVzop73tBLZG+6d5AgZBJng6MeisEHca8gSLhicMLm3FTjaAUChswdtAxy53CZqY+5bYA==
            </strSessionToken>
            <updateJsonObject>
                {"IDOName":"SLCoitems","PropertyList":["coiUf_StandNum","DerExtPrice","Whse","PriceConv","ShipSite","coiUf_Note","InvoiceHold","Item","Stat","CoLine","Disc","QtyOrderedConv","UM","CoNum","CoCustNum","coiUf_rework","coiUf_Lot","AdrCurrCode"],"Items":[{"EditStatus":3,"Properties":[{"Updated":true,"Property":"规格型号测试"},{"Updated":true,"Property":222.0},{"Updated":true,"Property":"MAIN"},{"Updated":true,"Property":222.0},{"Updated":true,"Property":"HXSW"},{"Updated":true,"Property":"无"},{"Updated":true,"Property":0},{"Updated":true,"Property":"物料编号测试"},{"Updated":true,"Property":"O"},{"Updated":true,"Property":1},{"Updated":true,"Property":1.0},{"Updated":true,"Property":1},{"Updated":true,"Property":"g"},{"Updated":true,"Property":"SF20013182"},{"Updated":true,"Property":"JSH0305"},{"Updated":true,"Property":0},{"Updated":true,"Property":"1307040101-1000"},{"Updated":true,"Property":"CNY"}]}]}
            </updateJsonObject>
            <strCustomInsert/>
            <strCustomUpdate/>
            <strCustomDelete/>
        </SaveJson>
    </S:Body>
</S:Envelope>
